fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ПараметрыЗаписи)

Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда

ТекстОшибки = "";

// Проверка всех реквизитов
Если Не ЗначениеЗаполнено(Объект.ВКМ_ДатаНачала) Тогда
ТекстОшибки = ТекстОшибки + "• Не заполнена дата начала" + Символы.ПС;
КонецЕсли;

Если Не ЗначениеЗаполнено(Объект.ВКМ_ДатаОкончания) Тогда
ТекстОшибки = ТекстОшибки + "• Не заполнена дата окончания" + Символы.ПС;
КонецЕсли;

Если Не ЗначениеЗаполнено(Объект.ВКМ_АбонентскаяПлата) ИЛИ Объект.ВКМ_АбонентскаяПлата <= 0 Тогда
ТекстОшибки = ТекстОшибки + "• Не заполнена абонентская плата или указано некорректное значение" + Символы.ПС;
КонецЕсли;

Если Не ЗначениеЗаполнено(Объект.ВКМ_СтоимостьЧаса) ИЛИ Объект.ВКМ_СтоимостьЧаса <= 0 Тогда
ТекстОшибки = ТекстОшибки + "• Не заполнена стоимость часа или указано некорректное значение" + Символы.ПС;
КонецЕсли;

// Если есть ошибки - выводим сообщение
Если ТекстОшибки <> "" Тогда
Сообщение = Новый СообщениеПользователю;
Сообщение.Текст = "Для абонентского обслуживания необходимо заполнить:" + Символы.ПС + ТекстОшибки;
Сообщение.Сообщить();
КонецЕсли;

КонецЕсли;
КонецПроцедуры

//&НаКлиенте
//Поцедура ПередЗаписью(Отказ, ПараметрыЗаписи)
// ПередЗаписьюНаСервере();
//КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()

Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
ДобавитьРеквизитыНаФорму();
Иначе
УдалитьДополнительныеРеквизиты();
КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыНаФорму()

ГруппаДополнительные = Элементы.Дополнительные;

ПолеДатаНачала = Элементы.Добавить("ВКМ_ДатаНачала", Тип("ПолеФормы"));
ПолеДатаНачала.Вид = ВидПоляФормы.ПолеВвода;
ПолеДатаНачала.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
ПолеДатаНачала.Заголовок = "Дата начала";

ПолеДатаОкончания = Элементы.Добавить("ВКМД_атаОкончания", Тип("ПолеФормы"));
ПолеДатаОкончания.Вид = ВидПоляФормы.ПолеВвода;
ПолеДатаОкончания.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
ПолеДатаОкончания.Заголовок = "Дата окончания";

ПолеАбонентскаяПлата = Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"));
ПолеАбонентскаяПлата.Вид = ВидПоляФормы.ПолеВвода;
ПолеАбонентскаяПлата.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
ПолеАбонентскаяПлата.Заголовок = "Абонентская плата";

ПолеСтоимостьЧаса = Элементы.Добавить("ВКМ_СтоимостьЧаса", Тип("ПолеФормы"));
ПолеСтоимостьЧаса.Вид = ВидПоляФормы.ПолеВвода;
ПолеСтоимостьЧаса.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
ПолеСтоимостьЧаса.Заголовок = "Стоимость часа";

КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительныеРеквизиты()
	
	Элемент = Элементы.Найти("ВКМ_ДатаНачала");
	Если Элемент <> Неопределено Тогда
		Элементы.Удалить(Элемент);
	КонецЕсли;
	
	Элемент = Элементы.Найти("ВКМ_ДатаОкончания");
	Если Элемент <> Неопределено Тогда
		Элементы.Удалить(Элемент);
	КонецЕсли;
	
	Элемент = Элементы.Найти("ВКМ_АбонентскаяПлата");
	Если Элемент <> Неопределено Тогда
		Элементы.Удалить(Элемент);
	КонецЕсли;
	
	Элемент = Элементы.Найти("ВКМ_СтоимостьЧаса");
	Если Элемент <> Неопределено Тогда
		Элементы.Удалить(Элемент);
	КонецЕсли;
	
КонецПроцедуры
